# Dockerfile
#
# Этот Dockerfile используется для сборки Docker-образа FastAPI приложения.
# Он устанавливает зависимости, копирует исходный код и настраивает команду для запуска приложения.

# Используем официальный образ Python 3.10 в облегченной версии Debian Buster.
# Это обеспечивает стабильную и минимальную среду.
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера.
# Все последующие команды будут выполняться относительно этой директории.
WORKDIR /app

# Копируем файл зависимостей в рабочую директорию контейнера.
COPY ./requirements.txt /app/requirements.txt

# Устанавливаем Python-зависимости из requirements.txt.
# --no-cache-dir уменьшает размер образа, удаляя кеш pip.
RUN pip install --no-cache-dir -r /app/requirements.txt

# Копируем исходный код приложения в контейнер.
# Директория 'app' в корне проекта будет скопирована в '/app/app' внутри контейнера.
COPY ./app /app/app

# Открываем порт 8000 внутри контейнера, который будет слушать FastAPI приложение.
EXPOSE 8000

# Команда, которая будет выполняться при запуске контейнера.
# Запускает Uvicorn сервер с приложением FastAPI на всех сетевых интерфейсах (0.0.0.0)
# и на порту 8000.
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0", "--port", "8000"]
